In [65]:
import json
import pandas as pd
import numpy as np

In [68]:
data = json.load(open("response.json"))
data["users"]

[{'first_name': 'Vaibhav',
  'last_name': 'Shukla',
  'email': 'vaibhavshukla.try@gmail.com',
  'occupation': 'developer'},
 {'first_name': 'Shankar',
  'last_name': 'Shekhawat',
  'email': 'shankar.shaikhawat@gmail.com',
  'occupation': 'customer support'}]

In [69]:
users = pd.json_normalize(data, "users")
companies = pd.json_normalize(data, "companies")

In [70]:
companies

  company_name evaluation           email
0         nike        1B$   hello@nike.in
1        apple     1200B$  hello@apple.in

In [71]:
pd.concat([users, companies], keys=["users", "companies"],)
# users.append(companies)

            first_name  last_name                         email  \
users     0    Vaibhav     Shukla   vaibhavshukla.try@gmail.com
          1    Shankar  Shekhawat  shankar.shaikhawat@gmail.com
companies 0        NaN        NaN                 hello@nike.in
          1        NaN        NaN                hello@apple.in

                   occupation company_name evaluation
users     0         developer          NaN        NaN
          1  customer support          NaN        NaN
companies 0               NaN         nike        1B$
          1               NaN        apple     1200B$